devdnl/dnx-rtos/src/system/drivers/sdspi/stm32f1/sdspi.c
                        /* set R/W block length to 512 */
                        if (!timeout || send_cmd(hdl, CMD16, SECTOR_SIZE) != 0) {
                                hdl->card_type = 0;
                        }
                }

                if (timeout) {
                        hdl->card_initialized = true;
                }
        }

        ioctl(hdl->gpio_file, GPIO_IORQ_SD_DESELECT);
        spi_rw(0xFF);

        if (hdl->card_initialized == false) {
                printk(FONT_COLOR_RED"Card not initialized...\n"RESET_ATTRIBUTES);
                return STD_RET_ERROR;
        } else {
                printk("Card initialized. Card type: 0x%x\n", hdl->card_type);
                return STD_RET_OK;
        }
}

//==============================================================================
/**
 * @brief Function detect partitions
 *
 * @param[in] *hdl      SD module data
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t detect_partitions(struct sdspi_data *hdl) /* TODO detect_partitions */
{
        return STD_RET_ERROR;
}

//==============================================================================
/**
 * @brief Read data from card
 *
 * @param[in]  *hdl             driver's memory handle
 * @param[out] *dst             destination
 * @param[in]   size            item size
 * @param[in]   nitems          n-items to read
 * @param[in]   lseek           file index
 *
 * @retval number of read nitems
 */
//==============================================================================
static size_t card_read(struct sdspi_data *hdl, void *dst, size_t size, size_t nitems, u64_t lseek)
{
        size_t n = 0;

        if (hdl->card_initialized == false) {
                return 0;
        }

        /* whole sector(s) read */
        if (((size * nitems) % SECTOR_SIZE == 0) && (lseek % SECTOR_SIZE == 0)) {

                n  = read_whole_sectors(hdl, dst, (size * nitems) / SECTOR_SIZE, lseek);
                n *= SECTOR_SIZE / size;

        } else {
                n  = read_partial_sectors(hdl, dst, size * nitems, lseek);
                n /= size;
        }

        ioctl(hdl->gpio_file, GPIO_IORQ_SD_DESELECT);
        spi_rw(0xFF);
        return n;
}

//==============================================================================
/**
 * @brief Write data to card
 *
 * @param[in] *hdl              driver's memory handle
 * @param[in] *src              source
 * @param[in]  size             item size
 * @param[in]  nitems           n-items to write
 * @param[in]  lseek            file index
 *
 * @retval number of written nitems
 */
//==============================================================================
static size_t card_write(struct sdspi_data *hdl, const void *src, size_t size, size_t nitems, u64_t lseek)
{
        size_t n = 0;

        if (hdl->card_initialized == false) {
                return 0;
        }

        /* whole sector(s) read */
        if (((size * nitems) % SECTOR_SIZE == 0) && (lseek % SECTOR_SIZE == 0)) {

                n  = write_whole_sectors(hdl, src, (size * nitems) / SECTOR_SIZE, lseek);
                n *= SECTOR_SIZE / size;

        } else {
                n  = write_partial_sectors(hdl, src, size * nitems, lseek);
                n /= size;
        }

        ioctl(hdl->gpio_file, GPIO_IORQ_SD_DESELECT);
        spi_rw(0xFF);
        return n;
}

//==============================================================================
/**
 * @brief DMA operation finish interrupt
 */
//==============================================================================
#if (SDSPI_ENABLE_DMA != 0)
void SDSPI_DMA_ISR(void)
{
        disable_Rx_DMA();
        disable_Tx_DMA();

        SDSPI_DMA_RX_CHANNEL->CCR = 0x00;
        SDSPI_DMA_TX_CHANNEL->CCR = 0x00;

        NVIC_DisableIRQ(SDSPI_DMA_IRQ);

        SDSPI_DMA->IFCR = DMA_IFCR_CTCIF1 << (4 * (SDSPI_DMA_RX_CHANNEL_NO - 1));

        i32_t woke;
        give_semaphore_from_ISR(sdspi_data->wait_for_ready_sem, &woke);
}
#endif


#ifdef __cplusplus
}
#endif

/*==============================================================================
  End of file
==============================================================================*/
